<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of BetterTouchTool and creates a package. Then, uploads to the Jamf Pro Server.</string>
	<key>Identifier</key>
	<string>com.github.pythoninthegrass-recipes.jss.BetterTouchTool</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Utility</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>BetterTouchTool</string>
		<key>POLICY_CATEGORY</key>
		<string>Utility</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate-AllManagedClients.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>BetterTouchTool is a great, feature packed app that allows you to customize various input devices on your Mac.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>BetterTouchTool.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.pkg.BetterTouchTool</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.homebysix.download.BetterTouchTool</key>
			<dict>
				<key>git_hash</key>
				<string>0632ee1ca57ffe96660daa4fe1c16fba5987ee6d</string>
				<key>path</key>
				<string>/Volumes/Data/autopkg/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/BetterTouchTool/BetterTouchTool.download.recipe</string>
				<key>sha256_hash</key>
				<string>cb2031d632b797711f87b71cd4bf3cfa09191fe43304f7d59841c6218151650f</string>
			</dict>
			<key>com.github.homebysix.pkg.BetterTouchTool</key>
			<dict>
				<key>git_hash</key>
				<string>8a011dfd74579a361268b4c6d5cd07e7e9166b9c</string>
				<key>path</key>
				<string>/Volumes/Data/autopkg/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/BetterTouchTool/BetterTouchTool.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>15d546d560754776d2f0178e4a795454f6cd941864a3dde6d2615a51fe589ca0</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
