<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest Spotify dmg and creates a pkg from it. Then, uploads to the Jamf Pro Server.</string>
		<key>Identifier</key>
		<string>com.github.pythoninthegrass-recipes.jss.Spotify</string>
		<key>Input</key>
		<dict>
			<key>CATEGORY</key>
			<string>Apps</string>
			<key>GROUP_NAME</key>
			<string>%NAME%-update-smart</string>
			<key>GROUP_TEMPLATE</key>
			<string>SmartGroupTemplate.xml</string>
			<key>NAME</key>
			<string>Spotify</string>
			<key>POLICY_CATEGORY</key>
			<string>Apps</string>
			<key>POLICY_TEMPLATE</key>
			<string>PolicyTemplate-AllManagedClients.xml</string>
			<key>SELF_SERVICE_DESCRIPTION</key>
			<string>Stream music, create playlists and more.</string>
			<key>SELF_SERVICE_ICON</key>
			<string>Spotify.png</string>
			<key>STOP_IF_NO_JSS_UPLOAD</key>
			<false/>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>com.github.homebysix.pkg.Spotify</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>category</key>
					<string>%CATEGORY%</string>
					<key>groups</key>
					<array>
						<dict>
							<key>name</key>
							<string>%GROUP_NAME%</string>
							<key>smart</key>
							<true/>
							<key>template_path</key>
							<string>%GROUP_TEMPLATE%</string>
						</dict>
					</array>
					<key>policy_category</key>
					<string>%POLICY_CATEGORY%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>prod_name</key>
					<string>%NAME%</string>
					<key>self_service_description</key>
					<string>%SELF_SERVICE_DESCRIPTION%</string>
					<key>self_service_icon</key>
					<string>%SELF_SERVICE_ICON%</string>
					<key>prod_name</key>
					<string>%NAME%</string>
					<key>skip_scripts</key>
					<false/>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
			</dict>
		</array>
	</dict>
</plist>
